"""Ex.1 เขียนโปรแกรมรับสตริงมา 1 ค่า ซึ่งมี . เป็นตัวคั่น แล้วแยกสตริงตามตัวคั่นเป็น List ของสตริง ls"""

# x = input()
# ls = x.split('.')

"""Ex.2 เขียนโปรแกรมรับสตริงมา 1 ค่า ซึ่งประกอบด้วยจำนวนเต็มหลายค่า ซึ่งมี . เป็นตัวคั่น แล้วแยกสตริงตามตัวคั่นเป็น List ของจำนวนเต็ม ls"""

# x = input()
# ls = x.split('.')
# ls = [ int(x) for x in ls ]

"""
    Ex.3 เขียนโปรแกรมรับค่าจุดพิกัดบนระนาบ xy มา 2 บรรทัด แต่ละบรรทัดเป็นจำนวนจริง 2 จำนวน คั่นด้วย ,
    สมมติให้บรรทัดแรกเป็นจุดที่ 1 มีค่า x1,y1 และบรรทัดที่ 2 เป็นจุดที่ 2 มีค่า x2,y2
    แสดงผลลัพธ์เป็นผลบวกของจุดทั้งสอง (x1+x2),(y1+y2)
"""

xy1 = input()
xy2 = input()

x1, y1, = xy1.split(',')
x2, y2, = xy2.split(',')

print(f'{float(x1) + float(x2)},{float(y1) + float(y2)}')